<template>
    <div class="main">
        <header-component :addDecorationTopMenu="'/about'" :isGeneral="false"></header-component>

        <div class="wrapper">
            <section class="titlebar">
                <h1 class="page-title"><span>О компании</span></h1>
            </section>

            <hr class="col-md-6 bottom_15">

            <div class="cont">
                <section class="news-article top_60">
                    <h1 class="text-center">Центр сертификации &laquo;СертЭксперт&raquo;</h1>
                    <p class="top_30">Компания СертЭксперт уже не первый год работает на рынке сертификации, и имеет огромный
                    опыт в оформлении разрешительной документации, а также большое количество дружеских
                    органов и лабораторий. Благодаря этому достигается наиболее лояльный подход и оперативная
                    работа с клиентами.
                    Каждый сотрудник нашей компании является многопрофильным специалистом, готовым помочь
                    вам советом как с оформлением косметики, пищевой продукции, легкой промышленности, так и с
                    оформлением сложной техники, оборудованием, действующим под давлением, маслам и многим
                    другим.</p>
                    <h6>Компания СертЭксперт старается по максимуму использовать все доступные современные
                        технологии:</h6>
                    <ul>
                        <li>Оригиналы документов доставляются курьерскими службами, что позволяет снизить до
                            нуля вероятности их потери</li>
                        <li>Образцы при необходимости забираются нашим курьером</li>
                        <li>Переписку с менеджером вы можете вести как по электронной почте, так и использовать
                            любой удобный вам мессенджер, где можно, например, оперативно переслать
                            фотографии продукции с описанием</li>
                        <li>Если вы находитесь в другом городе, но хотели бы провести переговоры и обсудить
                            детали, то можно созвониться по видеосвязи Skype.</li>
                    </ul>
                    <h6>Наш офис работает с 9 утра до 7 вечера, что позволяет работать:</h6>
                    <ul>
                        <li>с импортерами во Владивостоке</li>
                        <li>с производителями в Сибири и Центральной части России</li>
                        <li>с импортерами Санкт-Петербурга и Москвы</li>
                        <li>с иностранными производителями в Европе</li>
                    </ul>
                    <h6>Мы всегда готовы поддержать вас советом и помочь в сложной ситуации, даже если срок
                        действия документа уже закончился.</h6>
                </section>
            </div> <!-- cont end -->
        </div> <!-- wrapper end -->
        <questions-section-2-component></questions-section-2-component>
        <footer-component></footer-component>
    </div>
</template>

<script>
    export default {}
</script>
