<template>
    <div class="main">
        <header-component :addDecorationTopMenu="'/about'" :isGeneral="false"></header-component>

        <div class="wrapper">
            <section class="titlebar">
                <h1 class="page-title"><span>О компании</span></h1>
            </section>

            <hr class="col-md-6 bottom_15">

            <div class="cont">
                <section class="news-article top_60 text-center">
                    <h1>Центр сертификации &laquo;СертЭксперт&raquo;</h1>
                    <p class="top_60">&laquo;СертЭксперт&raquo; – развивающаяся современная компания, главной задачей которой является грамотное
                        оформление документов и ускоренный подход к их получению клиентом.<br><br>

                        Компания  официальный представитель многих органов, лабораторий, и имеет соответствующие
                        этому свидетельства.<br><br>

                        Компания &laquo;СертЭксперт&raquo; обладает собственной системой сертификации и имеет собственных экспертов во
                        многих областях.<br><br>

                        Специалисты центра &laquo;СертЭксперт&raquo; опытные квалифицированные сотрудники, которые способны подробно
                        ответить на все волнующие вас вопросы.<br><br>

                        Консультацию у наших специалистов вы получаете как при просчете стоимости документа, так и
                        после, во время его действия.<br><br>

                        Все консультации, запросы и просчеты в нашем центре сертификации осуществляются бесплатно. Вы
                        платите только за оформление и работу над документацией.<br><br>

                        Подготовкой специалистов к работе занимаются опытные эксперты сертификации. Мы регулярно
                        проверяем изменения в законодательстве, чтобы оперативно уведомлять об этом наших клиентов.<br><br>

                        Наши сотрудники идут в ногу со временем и используют в работе не только телефон и электронную
                        почту, но также Skype, Viber, Telegram, WhatsApp.<br><br>

                        Центр сертификации &laquo;СертЭксперт&raquo; это профессионализм сотрудников и сохранение конфиденциальности
                        информации.<br><br>

                        С нами сотрудничают отечественные производства, крупные импортеры, а также иностранные
                        компании.</p>
                </section>
            </div> <!-- cont end -->
        </div> <!-- wrapper end -->
        <questions-section-component></questions-section-component>
        <footer-component></footer-component>
    </div>
</template>

<script>
    export default {}
</script>
